{"Order":1,"Name":"Introduction to App Configuration Migrator","Icon":null,"Languages":[{"Code":"en","Title":"Introduction to App Configuration Migrator","Slug":"introduction-to-app-configuration-migrator","ContentType":"html","Content":"<p><strong>App Configuration Migrator</strong> is the only DevOps tool that automates metadata and data deployments for industry-leading managed packaged solutions such as <em>Salesforce CPQ</em> and <em>Veeva</em>.</p><p>This is the only solution on the market that automatically packages all feature dependencies for Salesforce Managed package solutions. To facilitate rapid data migration processing and deployments, all templates are automatically bundled and packaged.</p><h2>Top Features of App Configuration Migrator</h2><p>The following are some of the most exciting features of app configuration migrator:</p><table style=\"width: 100%;\"><thead><tr><th style=\"width: 27.4553%;\">Feature</th><th style=\"width: 72.4331%;\">Description</th></tr></thead><tbody><tr><td style=\"width: 27.4553%;\">One-Click Deployments<br></td><td style=\"width: 72.4331%;\">App Configuration Migrator presents a friendly deployment wizard to combine objects, data relationships, and filters while defining a template and deploying them to your target environment in a quick deploy procedure.&nbsp; A deployment's configuration involves: selecting which versions of the data are to be deployed and then, choosing the target environment (test or production), along with other specific options for each environment.<br></td></tr><tr><td style=\"width: 27.4553%;\">EZ-Template Creation<br></td><td style=\"width: 72.4331%;\">It has an intuitive user interface for template creation that allows you to combine objects, data relationships, and filters while defining a template.<br></td></tr><tr><td style=\"width: 27.4553%;\">Configurable DataSet</td><td style=\"width: 72.4331%;\">You can configure the default dataset to match your business requirements. Its flexible and intuitive query builder allows you to define complex filters even while they're being deployed.<br></td></tr><tr><td style=\"width: 27.4553%;\">Validate DataSet<br></td><td style=\"width: 72.4331%;\">Validate your datasets before the deployment is actually run.</td></tr><tr><td style=\"width: 27.4553%;\">AutoRABIT External ID<br></td><td style=\"width: 72.4331%;\">Create a record in a development environment with the same Salesforce ID as in another environment. An external ID is a custom field that has the External ID attribute, meaning that it&nbsp;contains unique record identifiers from a system outside of Salesforce.<br></td></tr><tr><td style=\"width: 27.4553%;\">Data Masking</td><td style=\"width: 72.4331%;\">Mask sensitive data in your sandboxes. The masking process lets you mask some or all sensitive data with different levels of masking, depending on the sensitivity of the data.<br></td></tr><tr><td style=\"width: 27.4553%;\">Template Deployment</td><td style=\"width: 72.4331%;\">Deploy the configuration templates to the new environments in a quick manner; and also track the deployment progress.<br></td></tr><tr><td style=\"width: 27.4553%;\">Automatic Field Mappings<br></td><td style=\"width: 72.4331%;\">You can use the auto-mapping feature to map fields from the source schema to the target schema. Automatic mapping is useful when the source and target fields are mostly the same names and you are using one-to-one mapping.<br></td></tr><tr><td style=\"width: 27.4553%;\">Deactivates Workflows and Validation Rules</td><td style=\"width: 72.4331%;\">Automatically disable the validation and workflows rules that you have set to ensure&nbsp;a successful deployment when working with data components.<br></td></tr></tbody></table>","OriginalURI":"https://knowledgebase.autorabit.com/docs/introduction-to-app-configuration-migrator"}],"CategoryType":1}